import { Component } from '@angular/core';

export interface Route {
  'Наименование авиакомпании': string;
  'Аэропорт отправления': string;
  'Аэропорт назначения': string;
  'Протяженность маршрута (расстояние в одну сторону); км': string;
  'Тип воздушного судна': string;
  'Количество кресел': string;
  'Период выполнения': string;
  'Частота полетов в неделю': string;
  'Количество парных перелетов в 2024 году': string;
  // 'Примечание': string;
}

@Component({
  selector: 'app-routes',
  templateUrl: './routes.component.html',
  styleUrls: ['./routes.component.scss']
})
export class RoutesComponent {
  routes: Route[] = [
    {
      'Наименование авиакомпании': 'АО «АК Смартавиа»',
      'Аэропорт отправления': 'Калининград',
      'Аэропорт назначения': 'Челябинск',
      'Протяженность маршрута (расстояние в одну сторону); км': '2 566',
      'Тип воздушного судна': 'Б737-7',
      'Количество кресел': '148',
      'Период выполнения': '01.01.2024-31.12.2024',
      'Частота полетов в неделю': '1',
      'Количество парных перелетов в 2024 году': '52',
      // 'Примечание': 'Софинансирование Челябинской областью 50%'
    },
    {
      'Наименование авиакомпании': 'ПАО «Аэрофлот»',
      'Аэропорт отправления': 'Красноярск',
      'Аэропорт назначения': 'Челябинск',
      'Протяженность маршрута (расстояние в одну сторону); км': '1 927',
      'Тип воздушного судна': 'SSJ',
      'Количество кресел': '100',
      'Период выполнения': '01.01.2024-31.05.2024; 01.09.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '78',
      // 'Примечание': 'Софинансирование Красноярским краем 30;5% и Челябинской областью 30;5%.  ВС Boeing 737-800/A319/A320'
    },
    {
      'Наименование авиакомпании': 'АО «Ред Вингс»',
      'Аэропорт отправления': 'Махачкала',
      'Аэропорт назначения': 'Челябинск',
      'Протяженность маршрута (расстояние в одну сторону); км': '1 710',
      'Тип воздушного судна': 'SSJ-100',
      'Количество кресел': '100',
      'Период выполнения': '01.01.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '30',
      // 'Примечание': 'Софинансируемый  Челябинской обл. 30;5% и Респ.Дагестан 30;5%;  ВС Ту204/214'
    },
    {
      'Наименование авиакомпании': 'АО «Авиакомпания АЗИМУТ»',
      'Аэропорт отправления': 'Минеральные Воды',
      'Аэропорт назначения': 'Челябинск',
      'Протяженность маршрута (расстояние в одну сторону); км': '1 797',
      'Тип воздушного судна': 'SU 95',
      'Количество кресел': '100',
      'Период выполнения': '01.01.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '61',
      // 'Примечание': 'Софинансируемый Ставропольским краем  и Челябинской  областью-30;5%'
    },
    {
      'Наименование авиакомпании': 'АО «Ред Вингс»',
      'Аэропорт отправления': 'Самара',
      'Аэропорт назначения': 'Челябинск',
      'Протяженность маршрута (расстояние в одну сторону); км': '761',
      'Тип воздушного судна': 'SSJ-100',
      'Количество кресел': '100',
      'Период выполнения': '01.01.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '104',
      // 'Примечание': 'Софинансируемый Самарской обл. 30;5% и Челябинской обл. 30;5%;  ВС Ту204/214'
    },
    {
      'Наименование авиакомпании': 'ПАО «Авиакомпания «Ютэйр»',
      'Аэропорт отправления': 'Сургут',
      'Аэропорт назначения': 'Челябинск',
      'Протяженность маршрута (расстояние в одну сторону); км': '965',
      'Тип воздушного судна': 'ATR-72',
      'Количество кресел': '70',
      'Период выполнения': '01.01.2024-31.05.2024; 01.09.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '78',
      // 'Примечание': 'Софинансирование двумя субъектами РФ 50%;  ВС Boeing 737-500; Boeing 737-800; Boeing 737-400'
    },
    {
      'Наименование авиакомпании': 'ПАО «Авиакомпания «Ютэйр»',
      'Аэропорт отправления': 'Ханты-Мансийск',
      'Аэропорт назначения': 'Челябинск',
      'Протяженность маршрута (расстояние в одну сторону); км': '776',
      'Тип воздушного судна': 'ATR-72',
      'Количество кресел': '70',
      'Период выполнения': '01.01.2024-31.05.2024; 01.09.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '78',
      // 'Примечание': 'Софинансирование двумя субъектами РФ 50%;  ВС Boeing 737-500; Boeing 737-800; Boeing 737-400'
    },
    {
      'Наименование авиакомпании': 'АО «Ред Вингс»',
      'Аэропорт отправления': 'Челябинск',
      'Аэропорт назначения': 'Волгоград',
      'Протяженность маршрута (расстояние в одну сторону); км': '1 375',
      'Тип воздушного судна': 'SSJ-100',
      'Количество кресел': '100',
      'Период выполнения': '01.01.2024-28.02.2024',
      'Частота полетов в неделю': '1',
      'Количество парных перелетов в 2024 году': '8',
      // 'Примечание': 'Софинансируемый  Челябинской обл. 30;5% и Волгоградская обл. 30;5%;  ВС Ту204/214'
    },
    {
      'Наименование авиакомпании': 'АО «Ред Вингс»',
      'Аэропорт отправления': 'Челябинск',
      'Аэропорт назначения': 'Волгоград',
      'Протяженность маршрута (расстояние в одну сторону); км': '1 375',
      'Тип воздушного судна': 'SSJ-100',
      'Количество кресел': '100',
      'Период выполнения': '01.03.2024-31.05.2024; 01.09.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '61',
      // 'Примечание': 'Софинансируемый  Челябинской обл. 30;5% и Волгоградская обл. 30;5%;  ВС Ту204/214'
    },
    {
      'Наименование авиакомпании': 'АО «Ред Вингс»',
      'Аэропорт отправления': 'Челябинск',
      'Аэропорт назначения': 'Казань',
      'Протяженность маршрута (расстояние в одну сторону); км': '770',
      'Тип воздушного судна': 'SSJ-100',
      'Количество кресел': '100',
      'Период выполнения': '01.01.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '60',
      // 'Примечание': 'Софинансируемый  Челябинской обл. 30;5% и Респ.Татарстан 30;5%;  ВС Ту204/214'
    },
    {
      'Наименование авиакомпании': 'АО «Ред Вингс»',
      'Аэропорт отправления': 'Челябинск',
      'Аэропорт назначения': 'Нижневартовск',
      'Протяженность маршрута (расстояние в одну сторону); км': '1 077',
      'Тип воздушного судна': 'SSJ-100',
      'Количество кресел': '100',
      'Период выполнения': '01.01.2024-31.12.2024',
      'Частота полетов в неделю': '2',
      'Количество парных перелетов в 2024 году': '95',
      // 'Примечание': 'Софинансируемый  Челябинской обл. 25% и ХМАО 25%;  ВС Ту204/214'
    },
    {
      'Наименование авиакомпании': 'АО «Ред Вингс»',
      'Аэропорт отправления': 'Челябинск',
      'Аэропорт назначения': 'Нижний Новгород',
      'Протяженность маршрута (расстояние в одну сторону); км': '1 110',
      'Тип воздушного судна': 'SSJ-100',
      'Количество кресел': '100',
      'Период выполнения': '01.01.2024-31.12.2024',
      'Частота полетов в неделю': '1',
      'Количество парных перелетов в 2024 году': '39',
      // 'Примечание': 'Софинансируемый  со стороны Челябинской обл. 61%;  ВС Ту204/214'
    }
  ];
}
